---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.FailedToChangeInstSymbol
source: html/7f5d9a21-573b-fb14-9551-d4adc4e05904.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.FailedToChangeInstSymbol Property

Failed to change symbol of instance.

## Syntax (C#)
```csharp
public static FailureDefinitionId FailedToChangeInstSymbol { get; }
```